kind3r/esp8266-xpressnet-lib/esp8266-XpressNet.cpp
/*
*****************************************************************************
  *		XpressNet.h - library for a client XpressNet protocoll
  *		Copyright (c) 2015-2017 Philipp Gahtow  All right reserved.
  *
  **	 Free for Private usage only!	
*****************************************************************************
  * IMPORTANT:
  * 
  * 	Please contact Lenz Inc. for details.
*****************************************************************************
 *  see for changes in XpressNet.h!
*/

// include this library's description file
#include "esp8266-XpressNet.h"

#if defined(__AVR__)
#include <avr/interrupt.h>
#endif

#define interval 10500      //interval for Status LED (milliseconds)

XpressNetClass *XpressNetClass::active_object = 0;	//Static

// Constructor /////////////////////////////////////////////////////////////////
// Function that handles the creation and setup of instances

XpressNetClass::XpressNetClass()
{
	// initialize this instance's variables 
	Railpower = 0xFF;		//Ausgangs undef.
	XNetclearSendBuf();
	XNetRun = false;	//XNet ist inactive;
	xLokStsclear();		//l�schen aktiver Loks in Slotserver
	ReqLocoAdr = 0;
	ReqLocoAgain = 0;
	ReqFktAdr = 0;
	SlotLast = 0;			
	ReadData = false;		//keine Serial Daten Speichern
}

//******************************************Serial*******************************************
void XpressNetClass::start(byte XAdr, int XControl, bool XControlReverse)  //Initialisierung Serial
{
	ledState = LOW;       // Status LED, used to set the LED
	previousMillis = 0;		//Reset Time Count
	SlotTime = millis();   // will store last time LED was updated
	if (notifyXNetStatus)
		notifyXNetStatus (ledState);

	MY_ADDRESS = XAdr;
	MAX485_CONTROL = XControl;
	MAX485_REVERSE = XControlReverse;
	
	myRequestAck = callByteParity (MY_ADDRESS | 0x00) | 0x100;
	myCallByteInquiry = callByteParity (MY_ADDRESS | 0x40) | 0x100;
	myDirectedOps = callByteParity (MY_ADDRESS | 0x60) | 0x100; 

	//Set up on 62500 Baud
#if defined(__AVR__)
	// LISTEN_MODE 
	if(MAX485_CONTROL >= 0) {
		pinMode(MAX485_CONTROL, OUTPUT);
		digitalWrite (MAX485_CONTROL, MAX485_REVERSE ? HIGH : LOW);
	}

	cli();  //disable interrupts while initializing the USART
	#if defined(SERIAL_PORT)
	 UBRRH = 0;
	 UBRRL = 0x0F;
	 UCSRA = 0;
	 UCSRB = (1<<RXEN) | (1<<TXEN) | (1<<RXCIE) | (1<<UCSZ2);
	 UCSRC = (1<<UCSZ1) | (1<<UCSZ0);
	#elif defined(SERIAL_PORT_0)
	 UBRR0H = 0;
	 UBRR0L = 0x0F;
	 UCSR0A = 0;
	 UCSR0B = (1<<RXEN0) | (1<<TXEN0) | (1<<RXCIE0) | (1<<UCSZ02);
	 UCSR0C = (1<<UCSZ01) | (1<<UCSZ00);
	 #elif defined(SERIAL_PORT_1)
	 UBRR1H = 0;
	 UBRR1L = 0x0F;
	 UCSR1A = 0;
	 UCSR1B = (1<<RXEN1) | (1<<TXEN1) | (1<<RXCIE1) | (1<<UCSZ12);
	 UCSR1C = (1<<UCSZ11) | (1<<UCSZ10);
	#endif
	sei(); // Enable the Global Interrupt Enable flag so that interrupts can be processed 
	/*
	 *  Enable reception (RXEN = 1).
	 *  Enable transmission (TXEN0 = 1). 
	 *	Enable Receive Interrupt (RXCIE = 1).
	 *  Set 8-bit character mode (UCSZ00, UCSZ01, and UCSZ02 together control this, 
	 *  But UCSZ00, UCSZ01 are in Register UCSR0C).
	 */
#elif defined(ARDUINO_ESP8266_ESP01)
	// start RS485 9 bit interface on 62500 baud rate
	rs485.setup(XNetRS485_RX, XNetRS485_TX);
	rs485.begin(62500, 9);
	if(MAX485_CONTROL >= 0) {
		rs485.setTransmitEnablePin(MAX485_CONTROL, MAX485_REVERSE);
	}
#endif
	active_object = this;		//hold Object to call it back in ISR
}

// Public Methods //////////////////////////////////////////////////////////////
// Functions available in Wiring sketches, this library, and other libraries

//*******************************************************************************************
//Daten ermitteln und Auswerten
void XpressNetClass::receive(void) 
{
#if defined(ARDUINO_ESP8266_ESP01)
	XNetget();
#endif
	/*
	XNetMsg[XNetlength] = 0x00;
	XNetMsg[XNetmsg] = 0x00;
	XNetMsg[XNetcommand] = 0x00;	savedData[1]
	XNetMsg[XNetdata1] = 0x00;	savedData[2]
	*/
  unsigned long currentMillis = millis();	//aktuelle Zeit setzten

  if (XNetMsg[XNetmsg] != 0x00 && ReadData == false) { 	//Serial Daten dekodieren
//	  previousMillis = millis();   // will store last time LED was updated
	  //Daten, setzte LED = ON!
	  if (ledState == LOW) {	//LED -> aktivieren!
		ledState = HIGH;
		if (notifyXNetStatus)
			notifyXNetStatus (ledState);
	  }
	  if (XNetMsg[XNetmsg] == GENERAL_BROADCAST) {
		  if (XNetMsg[XNetlength] == 4 && XNetMsg[XNetcom] == 0x61) {
			  if ((XNetMsg[XNetdata1] == 0x01) && (XNetMsg[XNetdata2] == 0x60)) {
				// Normal Operation Resumed
				Railpower = csNormal;
				if (notifyXNetPower)
					notifyXNetPower(Railpower);
			  } 
			  else if ((XNetMsg[XNetdata1] == 0x00) && (XNetMsg[XNetdata2] == 0x61)) {
				// Track power off
		        Railpower = csTrackVoltageOff; 
				if (notifyXNetPower)
					notifyXNetPower(Railpower);
			  }
			  else if ((XNetMsg[XNetdata1] == 0x08)) {
				  // Track Short
				  Railpower = csShortCircuit;
				  if (notifyXNetPower) {
					  notifyXNetPower(csTrackVoltageOff);
					  notifyXNetPower(Railpower);
				  }
			  }
			  else if ((XNetMsg[XNetdata1] == 0x02) && (XNetMsg[XNetdata2] == 0x63)) {
				// Service Mode Entry
			    Railpower = csServiceMode;
				if (notifyXNetPower)
					notifyXNetPower(Railpower);
		      }
		  } 
		  else if (XNetMsg[XNetcom] == 0x81) {
			if ((XNetMsg[XNetdata1] == 0x00) && (XNetMsg[XNetdata2] == 0x81)) {
				//Emergency Stop
				Railpower = csEmergencyStop;
				if (notifyXNetPower)
					notifyXNetPower(Railpower);
		     }
		  }
		  else if (XNetMsg[XNetlength] == 8 && XNetMsg[XNetcom] == 0x05 && XNetMsg[XNetdata1] == 0xF1) {
			  //DCC FAST CLOCK set request
			  /* 0x05 0xF1 TCODE1 TCODE2 TCODE3 TCODE4 [XOR]
				00mmmmmm	TCODE1, mmmmmm = denotes minutes, range 0...59.
				100HHHHH	TCODE2, HHHHH = denotes hours, range 0...23.
				01000www	TCODE3, www = denotes day of week, 0=monday, 1=tuesday, a.s.o.
				110fffff	TCODE4, fffff = denotes speed ratio, range 0..31. (0=stopped)
				*/
		  }
	}
	//else if (XNetMsg[XNetmsg] == myDirectedOps && XNetMsg[XNetlength] >= 3) {
		//change by Andr� Schenk
	else if (XNetMsg[XNetlength] >= 3) {	
//		Serial.print("RX: ");
//		Serial.print(XNetMsg[XNetcom], HEX);
//		Serial.print("-");
//		Serial.print(XNetMsg[XNetdata1], HEX);
//		Serial.print(" ");
//		Serial.print(XNetMsg[XNetdata2], HEX);
//		Serial.print(" ");
//		Serial.print(XNetMsg[XNetdata3], HEX);
//		Serial.print(" ");
//		Serial.print(XNetMsg[XNetdata4], HEX);
//		Serial.print("..");

