kind3r/esp8266-xpressnet-lib/esp8266-XpressNet.cpp
		switch (XNetMsg[XNetcom]) {
		//add by Norberto Redondo Melchor:	
		case 0x52:	// Some other device asked for an accessory change
          //if (XNetMsg[XNetlength] >= 3) {
			  //change by Andr� Schenk
			if (XNetMsg[XNetdata2] >= 0x80) {  
            // Pos = 0000A00P A = turnout output (active 0/inactive 1); P = Turn v1 or --0
            byte A_bit = (XNetMsg[XNetdata2] >> 3) & B0001;
            if (!A_bit) { // Accessory activation request
              unsigned int Adr = (XNetMsg[XNetdata1] << 2) | ((XNetMsg[XNetdata2] & B0110) >> 1);  // Dir afectada
              byte Pos = (XNetMsg[XNetdata2] & B0001) + 1;
              notifyTrnt(highByte(Adr), lowByte(Adr), Pos);
              //digitalWrite(6, HIGH); // Nice to see some blink
            }
            else { // Accessory deactivation request
              //digitalWrite(6, LOW); // Just a blink
            }
          }
		break;
		case 0x62:
			if (XNetMsg[XNetdata1] == 0x21 && XNetMsg[XNetlength] >= 4) {    //Sw Version 2.3
				// old version - version 1 and version 2 response.
	        }
			else if (XNetMsg[XNetdata1] == 0x22 && XNetMsg[XNetlength] >= 5) {
				if (XNetRun == false) {	//Softwareversion anfragen
						unsigned char commandVersionSequence[] = {0x21, 0x21, 0x00};
						XNetSendadd (commandVersionSequence, 3);
						XNetRun = true;
				}
				Railpower = csNormal;
				if (XNetMsg[XNetdata2] != 0) {
					// is track power turned off?
					if ((XNetMsg[XNetdata2] & 0x01) == 0x01) { Railpower = csEmergencyStop; } //Bit 0: wenn 1, Anlage in Nothalt
		            // is it in emergency stop?
					if ((XNetMsg[XNetdata2] & 0x02) == 0x02) { Railpower = csTrackVoltageOff; }  //Bit 1: wenn 1, Anlage in Notaus
					// in service mode?
					if ((XNetMsg[XNetdata2] & 0x08) == 0x08) {Railpower = csServiceMode;}   //Bit 3: wenn 1, dann Programmiermode aktiv          
					// in powerup mode - wait until complete
					if ((XNetMsg[XNetdata2] & 0x40) == 0x40) {
						// put us in a state where we do the status request again...
						XNetRun = false;
					}
				}
				if (notifyXNetPower)
					notifyXNetPower(Railpower);
			}
		break;
		case 0x61:
		  if (XNetMsg[XNetlength] >= 4) {
			if (XNetMsg[XNetdata1] == 0x13) {
				//Programmierinfo �Daten nicht gefunden�
				if (notifyCVInfo)
					notifyCVInfo(0x02);
			}
			if (XNetMsg[XNetdata1] == 0x1F) {
				//Programmierinfo �Zentrale Busy�
				if (notifyCVInfo)
					notifyCVInfo(0x01);
			}
			if (XNetMsg[XNetdata1] == 0x11) {
				//Programmierinfo �Zentrale Bereit�
				if (notifyCVInfo)
					notifyCVInfo(0x00);
			}
			if (XNetMsg[XNetdata1] == 0x12) {
				//Programmierinfo �short-circuit�
				if (notifyCVInfo)
					notifyCVInfo(0x03);
			}
			if (XNetMsg[XNetdata1] == 0x80) {
				//Transfer Error
				if (notifyCVInfo)
					notifyCVInfo(0xE1);
			}
			if (XNetMsg[XNetdata1] == 0x82) {
				//Befehl nicht vorhanden R�ckmeldung
			}
		  }
		break;	
		case 0x63:
			//Softwareversion Zentrale
			if ((XNetMsg[XNetdata1] == 0x21) && (XNetMsg[XNetlength] >= 5)) {
				if (notifyXNetVer)
					notifyXNetVer(XNetMsg[XNetdata2], XNetMsg[XNetdata3]);
			}
			//Programmierinfo �Daten 3-Byte-Format� & �Daten 4-Byte-Format�
			if ((XNetMsg[XNetdata1] == 0x10 || XNetMsg[XNetdata1] == 0x14) && XNetMsg[XNetlength] >= 5) {
				byte cvAdr = XNetMsg[XNetdata2];
				byte cvData = XNetMsg[XNetdata3];
				if (notifyCVResult)
					notifyCVResult(cvAdr, cvData);
			}
		break;
		case 0xE4:	//Antwort der abgefragen Lok
			if (XNetMsg[XNetlength] >= 7 && ReqLocoAdr != 0) {
				byte Adr_MSB = highByte(ReqLocoAdr);
				byte Adr_LSB = lowByte(ReqLocoAdr);
				ReqLocoAdr = 0;
				uint8_t Steps = XNetMsg[XNetdata1];		//0000 BFFF - B=Busy; F=Fahrstufen	
				bitWrite(Steps, 3, 0);	//Busy bit l�schen
				if (Steps == B100)
					Steps = B11;
				boolean Busy = false;
				if (bitRead(XNetMsg[XNetdata1], 3) == 1)
					Busy = true;
				uint8_t Speed = XNetMsg[XNetdata2];		//RVVV VVVV - R=Richtung; V=Geschwindigkeit
				bitWrite(Speed, 7, 0);	//Richtungs bit l�schen
				uint8_t Direction = false;
				if (bitRead(XNetMsg[XNetdata2], 7) == 1)
					Direction = true;
				uint8_t F0 = XNetMsg[XNetdata3];	//0 0 0 F0 F4 F3 F2 F1
				uint8_t F1 = XNetMsg[XNetdata4];	//F12 F11 F10 F9 F8 F7 F6 F5
				
				byte BSteps = Steps;
				if (Busy)
					bitWrite(BSteps, 3, 1);
				byte funcsts = F0;	//FktSts = Chg-F, X, Dir, F0, F4, F3, F2, F1
				bitWrite(funcsts, 5, Direction);	//Direction hinzuf�gen
				
				bool chg = xLokStsadd (Adr_MSB, Adr_LSB, BSteps, Speed, funcsts);	//Eintrag in SlotServer
				chg = chg | xLokStsFunc1 (Adr_MSB, Adr_LSB, F1);
				if (chg == true) 			//�nderungen am Zustand?
					getLocoStateFull(Adr_MSB, Adr_LSB, true);
				
				if (Speed == 0) { //Lok auf Besetzt schalten
					setLocoHalt (Adr_MSB, Adr_LSB);//Sende Lok HALT um Busy zu erzeugen!
				}
			}
		break;
		case 0xE3:	//Antwort abgefrage Funktionen F13-F28
			if (XNetMsg[XNetdata1] == 0x52 && XNetMsg[XNetlength] >= 6 && ReqFktAdr != 0) {	//Funktionszustadn F13 bis F28
				byte Adr_MSB = highByte(ReqFktAdr);
				byte Adr_LSB = lowByte(ReqFktAdr);
				ReqFktAdr = 0;
				byte F2 = XNetMsg[XNetdata2];	//F2 = F20 F19 F18 F17 F16 F15 F14 F13
				byte F3 = XNetMsg[XNetdata3];	//F3 = F28 F27 F26 F25 F24 F23 F22 F21
				if (xLokStsFunc23 (Adr_MSB, Adr_LSB, F2, F3) == true) {	//�nderungen am Zustand?
					if (notifyLokFunc)
						notifyLokFunc(Adr_MSB, Adr_LSB, F2, F3 );
					getLocoStateFull(Adr_MSB, Adr_LSB, true);
				}
			}
			if (XNetMsg[XNetdata1] == 0x40 && XNetMsg[XNetlength] >= 6) { 	// Locomotive is being operated by another device
				XLokStsSetBusy (XNetMsg[XNetdata2], XNetMsg[XNetdata3]);
			}
		break;
		case 0xE1:
			if (XNetMsg[XNetlength] >= 3) {
				//Fehlermeldung Lok control
				if (notifyCVInfo)
					notifyCVInfo(0xE1);
			}
		break;
		case 0x42:	//Antwort Schaltinformation
			if (XNetMsg[XNetlength] >= 4) {
				int Adr = XNetMsg[XNetdata1] * 4;
				byte nibble = bitRead(XNetMsg[XNetdata2], 4);
				byte Pos1 = XNetMsg[XNetdata2] & B11;
				byte Pos2 = (XNetMsg[XNetdata2] >> 2) & B11;
				if (nibble == 1)
					Adr = Adr + 2;
				if (notifyTrnt)
					notifyTrnt(highByte(Adr), lowByte(Adr), Pos1);
				if (notifyTrnt)
					notifyTrnt(highByte(Adr+1), lowByte(Adr+1), Pos2);
			}
		break;
		case 0xA3:	// Locomotive is being operated by another device
			if (XNetMsg[XNetlength] >= 4) {
				if (notifyXNetPower)
					notifyXNetPower(XNetMsg[XNetdata1]);
			}
		break;
		}	//switch myDirectedOps ENDE
	}
//	if (ReadData == false)	//Nachricht komplett empfangen, dann hier l�schen!
		XNetclear();	//alte verarbeitete Nachricht l�schen
  }		//Daten vorhanden ENDE
  else {	//keine Daten empfangen, setzte LED = Blink
	  previousMillis++;
	  if (previousMillis > interval) {			//WARTEN
		  XNetRun = false;	//Keine Zentrale vorhanden
		// save the last time you blinked the LED 
		previousMillis = 0;   
		// if the LED is off turn it on and off (Blink):
		ledState = !ledState;
		if (notifyXNetStatus)
			notifyXNetStatus (ledState);
	  }
  }
  //Slot Server aktualisieren
  if (currentMillis - SlotTime > SlotInterval) {
	  SlotTime = currentMillis;
	  UpdateBusySlot();		//Server Update - Anfrage nach Status�nderungen
  }
}

//--------------------------------------------------------------------------------------------
//Zustand der Gleisversorgung setzten
bool XpressNetClass::setPower(byte Power) 
{
	switch (Power) {	
	case csNormal: {
			unsigned char PowerAn[] = { 0x21, 0x81, 0xA0 };
			return XNetSendadd(PowerAn, 3);
		}
		case csEmergencyStop: {
			unsigned char EmStop[] = { 0x80, 0x80 };
			return XNetSendadd(EmStop, 2);
		}
		case csTrackVoltageOff: {
			unsigned char PowerAus[] = { 0x21, 0x80, 0xA1 };
			return XNetSendadd(PowerAus, 3);
		}
/*		case csShortCircuit:
			return false;
		case csServiceMode:
			return false;	*/
	}
	return false;
}

//--------------------------------------------------------------------------------------------
//Abfrage letzte Meldung �ber Gleispannungszustand
byte XpressNetClass::getPower() 
{
	return Railpower;
}

//--------------------------------------------------------------------------------------------
//Halt Befehl weiterleiten
void XpressNetClass::setHalt()
{
	setPower(csEmergencyStop);
}

//--------------------------------------------------------------------------------------------
//Abfragen der Lokdaten (mit F0 bis F12)
bool XpressNetClass::getLocoInfo (byte Adr_High, byte Adr_Low)	
{
	bool ok = false;
	
	getLocoStateFull(Adr_High, Adr_Low, false);
	
	byte Slot = xLokStsgetSlot(Adr_High, Adr_Low);
	if (xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;		//aktivit�t
		
	if (xLokStsBusy(Slot) == true && ReqLocoAdr == 0)	{		//Besetzt durch anderen XPressNet Handregler
		ReqLocoAdr = word(Adr_High, Adr_Low); //Speichern der gefragen Lok Adresse
		unsigned char getLoco[] = {0xE3, 0x00, Adr_High, Adr_Low, 0x00};
		getXOR(getLoco, 5);
		ok = XNetSendadd (getLoco, 5);
	}
	
	return ok;
}

//--------------------------------------------------------------------------------------------
//Abfragen der Lok Funktionszust�nde F13 bis F28
bool XpressNetClass::getLocoFunc (byte Adr_High, byte Adr_Low)	
{
	if (ReqFktAdr == 0) {
		ReqFktAdr = word(Adr_High, Adr_Low); //Speichern der gefragen Lok Adresse
		unsigned char getLoco[] = {0xE3, 0x09, Adr_High, Adr_Low, 0x00};
		getXOR(getLoco, 5);
		return XNetSendadd (getLoco, 5);
	}
	unsigned char getLoco[] = {0xE3, 0x09, highByte(ReqFktAdr), lowByte(ReqFktAdr), 0x00};
	getXOR(getLoco, 5);
	return XNetSendadd (getLoco, 5);
}

//--------------------------------------------------------------------------------------------
//Lok Stoppen
bool XpressNetClass::setLocoHalt (byte Adr_High, byte Adr_Low)
{
	bool ok = false;
	unsigned char setLocoStop[] = {0x92, Adr_High, Adr_Low, 0x00};
	getXOR(setLocoStop, 4);
	ok = XNetSendadd (setLocoStop, 4);

	byte Slot = xLokStsgetSlot(Adr_High, Adr_Low);
	xLokSts[Slot].speed = 0;	//STOP

	getLocoStateFull(Adr_High, Adr_Low, true);
	return ok;
}

//--------------------------------------------------------------------------------------------
//Lokdaten setzten
bool XpressNetClass::setLocoDrive (byte Adr_High, byte Adr_Low, uint8_t Steps, uint8_t Speed)
{
	bool ok = false;
	unsigned char setLoco[] = {0xE4, 0x10, Adr_High, Adr_Low, Speed, 0x00};
	setLoco[1] |= Steps;
	
	getXOR(setLoco, 6);
	ok = XNetSendadd (setLoco, 6);

	byte Slot = xLokStsgetSlot(Adr_High, Adr_Low);
	xLokSts[Slot].mode = (xLokSts[Slot].mode & B11111100) | Steps;	//Fahrstufen
	xLokSts[Slot].speed = Speed & B01111111;
	bitWrite(xLokSts[Slot].f0, 5, bitRead(Speed, 7));	//Dir

//	getLocoStateFull(Adr_High, Adr_Low, true);	

	//Nutzung protokollieren:
	if (xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;		//aktivit�t
	return ok;
}

//--------------------------------------------------------------------------------------------
//Lokfunktion setzten
bool XpressNetClass::setLocoFunc (byte Adr_High, byte Adr_Low, uint8_t type, uint8_t fkt)
{
	bool ok = false;	//Funktion wurde nicht gesetzt!
	bool fktbit = 0;	//neue zu �ndernde fkt bit
	if (type == 1)	//ein
		fktbit = 1;
	byte Slot = xLokStsgetSlot(Adr_High, Adr_Low);
	//zu �nderndes bit bestimmen und neu setzten:
	if (fkt <= 4) {
		byte func = xLokSts[Slot].f0 & B00011111;	//letztes Zustand der Funktionen 000 F0 F4..F1
		if (type == 2) { //um
			if (fkt == 0)
				fktbit = !(bitRead(func, 4));
			else fktbit = !(bitRead(func, fkt-1));
		}
		if (fkt == 0)
			bitWrite(func, 4, fktbit);
		else bitWrite(func, fkt-1, fktbit);
		//Daten �ber XNet senden:
		unsigned char setLocoFunc[] = {0xE4, 0x20, Adr_High, Adr_Low, func, 0x00};	//Gruppe1 = 0 0 0 F0 F4 F3 F2 F1
		getXOR(setLocoFunc, 6);
		ok = XNetSendadd (setLocoFunc, 6);
		//Slot anpassen:
		if (fkt == 0)
			bitWrite(xLokSts[Slot].f0, 4, fktbit);
		else bitWrite(xLokSts[Slot].f0, fkt-1, fktbit);
	}
	else if ((fkt >= 5) && (fkt <= 8)) {
		byte funcG2 = xLokSts[Slot].f1 & 0x0F;	//letztes Zustand der Funktionen 0000 F8..F5
		if (type == 2) //um
			fktbit = !(bitRead(funcG2, fkt-5));
		bitWrite(funcG2, fkt-5, fktbit);
		//Daten �ber XNet senden:
		unsigned char setLocoFunc[] = {0xE4, 0x21, Adr_High, Adr_Low, funcG2, 0x00};	//Gruppe2 = 0 0 0 0 F8 F7 F6 F5
		getXOR(setLocoFunc, 6);
		ok = XNetSendadd (setLocoFunc, 6);
		//Slot anpassen:
		bitWrite(xLokSts[Slot].f1, fkt-5, fktbit);
	}
	else if ((fkt >= 9) && (fkt <= 12)) {
		byte funcG3 = xLokSts[Slot].f1 >> 4;	//letztes Zustand der Funktionen 0000 F12..F9
		if (type == 2) //um
			fktbit = !(bitRead(funcG3, fkt-9));
		bitWrite(funcG3, fkt-9, fktbit);
		//Daten �ber XNet senden:
		unsigned char setLocoFunc[] = {0xE4, 0x22, Adr_High, Adr_Low, funcG3, 0x00};	//Gruppe3 = 0 0 0 0 F12 F11 F10 F9
		getXOR(setLocoFunc, 6);
		ok = XNetSendadd (setLocoFunc, 6);
		//Slot anpassen:
		bitWrite(xLokSts[Slot].f1, fkt-9+4, fktbit);
	}
	else if ((fkt >= 13) && (fkt <= 20)) {
		byte funcG4 = xLokSts[Slot].f2;
		if (type == 2) //um
			fktbit = !(bitRead(funcG4, fkt-13));
		bitWrite(funcG4, fkt-13, fktbit);
		//Daten �ber XNet senden:
		//unsigned char setLocoFunc[] = {0xE4, 0x23, Adr_High, Adr_Low, funcG4, 0x00};	//Gruppe4 = F20 F19 F18 F17 F16 F15 F14 F13
		unsigned char setLocoFunc[] = {0xE4, 0xF3, Adr_High, Adr_Low, funcG4, 0x00};	//Gruppe4 = F20 F19 F18 F17 F16 F15 F14 F13
		//0xF3 = undocumented command is used when a mulitMAUS is controlling functions f20..f13. 
		getXOR(setLocoFunc, 6);
		ok = XNetSendadd (setLocoFunc, 6);
		//Slot anpassen:
		bitWrite(xLokSts[Slot].f2, (fkt-13), fktbit);
	}
	else if ((fkt >= 21) && (fkt <= 28)) {
		byte funcG5 = xLokSts[Slot].f3;
		if (type == 2) //um
			fktbit = !(bitRead(funcG5, fkt-21));
		bitWrite(funcG5, fkt-21, fktbit);
		//Daten �ber XNet senden:
		unsigned char setLocoFunc[] = {0xE4, 0x28, Adr_High, Adr_Low, funcG5, 0x00};	//Gruppe5 = F28 F27 F26 F25 F24 F23 F22 F21
		getXOR(setLocoFunc, 6);
		ok = XNetSendadd (setLocoFunc, 6);
		//Slot anpassen:
		bitWrite(xLokSts[Slot].f3, (fkt-21), fktbit);
	}
	getLocoStateFull(Adr_High, Adr_Low, true);	//Alle aktiven Ger�te Senden!
	return ok;
}

//--------------------------------------------------------------------------------------------
//Gibt aktuellen Lokstatus an Anfragenden Zur�ck
void XpressNetClass::getLocoStateFull (byte Adr_High, byte Adr_Low, bool bc) 
{
	byte Slot = xLokStsgetSlot(Adr_High, Adr_Low);
	byte Busy = bitRead(xLokSts[Slot].mode, 3);
	byte Dir = bitRead(xLokSts[Slot].f0, 5);
	byte F0 = xLokSts[Slot].f0 & B00011111;
	byte F1 = xLokSts[Slot].f1;
	byte F2 = xLokSts[Slot].f2;
	byte F3 = xLokSts[Slot].f3;
		if (notifyLokAll)
			notifyLokAll(Adr_High, Adr_Low, Busy, xLokSts[Slot].mode & B11, xLokSts[Slot].speed, Dir, F0, F1, F2, F3, bc);
	//Nutzung protokollieren:
	if (xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;		//aktivit�t
}

//--------------------------------------------------------------------------------------------
//Ermitteln der Schaltstellung einer Weiche
bool XpressNetClass::getTrntInfo (byte FAdr_High, byte FAdr_Low)
{
	int Adr = word(FAdr_High, FAdr_Low);
	byte nibble = 0;	// 0 = Weiche 0 und 1; 1 = Weiche 2 und 3
	if ((Adr & 0x03) >= 2)
		nibble = 1;
	unsigned char getTrntPos[] = {0x42, 0x00, 0x80, 0x00};
	getTrntPos[1] = Adr >> 2;
	getTrntPos[2] += nibble;
	getXOR(getTrntPos, 4);
	return XNetSendadd (getTrntPos, 4);
}

//--------------------------------------------------------------------------------------------
//Schalten einer Weiche
bool XpressNetClass::setTrntPos (byte FAdr_High, byte FAdr_Low, byte Pos)
//Pos = 0000A00P	A=Weichenausgang (Aktive/Inaktive); P=Weiche nach links oder nach rechts 
{
	int Adr = word(FAdr_High, FAdr_Low);
	byte AdrL = ((Pos & 0x0F) | B110) & (((Adr & 0x03) << 1) | B1001); //1000ABBP -> A00P = Pos | BB = Adr & 0x03 (LSB Weichenadr.)

	Adr = Adr >> 2;
	bitWrite(AdrL, 7, 1);
	unsigned char setTrnt[] = {0x52, 0x00, AdrL, 0x00};	//old: 0x52, Adr, AdrL, 0x00
	//setTrnt[1] =  (Adr >> 2) & 0xFF;
	//change by Andr� Schenk:
	setTrnt[1] = Adr;
	getXOR(setTrnt, 4);

	//getTrntInfo(FAdr_High, FAdr_Low);  //Schaltstellung abfragen
	if (notifyTrnt)
		notifyTrnt(FAdr_High, FAdr_Low, (Pos & B1) + 1);

	return XNetSendadd (setTrnt, 4);
}

//--------------------------------------------------------------------------------------------
//CV-Mode CV Lesen
void XpressNetClass::readCVMode (byte CV)		
{
	unsigned char cvRead[] = {0x22, 0x15, CV, 0x00};
	getXOR(cvRead, 4);
	XNetSendadd (cvRead, 4);
	getresultCV(); //Programmierergebnis anfordern
}

//--------------------------------------------------------------------------------------------
//Schreiben einer CV im CV-Mode
void XpressNetClass::writeCVMode (byte CV, byte Data)
{
	unsigned char cvWrite[] = {0x23, 0x16, CV, Data, 0x00};
	getXOR(cvWrite, 5);
	XNetSendadd (cvWrite, 5);
	//getresultCV(); //Programmierergebnis anfordern

	if (notifyCVResult)
		notifyCVResult(CV, Data);
}

//--------------------------------------------------------------------------------------------
//Programmierergebnis anfordern
void XpressNetClass::getresultCV ()
{
	unsigned char getresult[] = {0x21, 0x10, 0x31};
	XNetSendadd (getresult, 3);
}

