kind3r/esp8266-xpressnet-lib/esp8266-XpressNet.cpp
// Private Methods ///////////////////////////////////////////////////////////////////////////////////////////////////
// Functions only available to other functions in this library *******************************************************

//--------------------------------------------------------------------------------------------
// calculate the XOR
void XpressNetClass::getXOR (unsigned char *data, byte length) {
	byte XOR = 0x00;
	for (int i = 0; i < (length-1); i++) {
        XOR = XOR ^ *data;
		data++;
    }
	*data = XOR;
}

//--------------------------------------------------------------------------------------------
// calculate the parity bit in the call byte for this guy
byte XpressNetClass::callByteParity (byte me) {
 byte parity = (1==0);
 byte vv;
 me &= 0x7f;
 vv = me;

 while (vv) {
       parity = !parity;
       vv &= (vv-1);
 }
 if (parity) me |= 0x80;
 return me;
}

//--------------------------------------------------------------------------------------------
int XpressNetClass::USART_Receive(void)
{
#if defined(__AVR__)
	unsigned char status, resh, resl;
	// Wait for data to be received
#if defined(SERIAL_PORT)
	status = UCSRA;
	while (!(status & (1 << RXC))) { return -1; }//status = UCSRA;}

	// Get status and 9th bit, then data
	resh = UCSRB;
	resl = UDR;

	// If error, return -1 
	if (status & ((1 << FE) | (1 << DOR) | (1 << PE))) { return -1; }

#elif defined(SERIAL_PORT_0)
	status = UCSR0A;
	while (!(status & (1 << RXC0))) { return -1; }//status = UCSR0A;}

	// Get status and 9th bit, then data
	resh = UCSR0B;
	resl = UDR0;

	//If error, return -1 
	if (status & ((1 << FE0) | (1 << DOR0) | (1 << UPE0))) { return -1; }

#elif defined(SERIAL_PORT_1)
	status = UCSR1A;
	while (!(status & (1 << RXC1))) { return -1; }//status = UCSR1A;}

	// Get status and 9th bit, then data 
	resh = UCSR1B;
	resl = UDR1;

	// If error, return -1
	if (status & ((1 << FE1) | (1 << DOR1) | (1 << UPE1))) { return -1; }
#endif

	// Filter the 9th bit, then return 
	resh = (resh >> 1) & 0x01;
	return ((resh << 8) | resl);
#elif defined(ARDUINO_ESP8266_ESP01)
	if (rs485.available()) {
		int dat = rs485.read();
		return dat;
	} else {
		return -1;
	}
#endif
}

//--------------------------------------------------------------------------------------------
void XpressNetClass::USART_Transmit(unsigned char data8) {
#if defined(__AVR__)
 // wait for empty transmit buffer
 #if defined(SERIAL_PORT)
  while (!(UCSRA & (1<<UDRE))) {}
 // put the data into buffer, and send 
 UDR = data8;
 #elif defined(SERIAL_PORT_0)
  while (!(UCSR0A & (1<<UDRE0))) {}
 // put the data into buffer, and send 
 UDR0 = data8;
 #elif defined(SERIAL_PORT_1)
 while (!(UCSR1A & (1<<UDRE1))) {}
 // put the data into buffer, and send
 UDR1 = data8;
 #endif
#elif defined(ARDUINO_ESP8266_ESP01)
	rs485.write(data8);
#endif
}

//--------------------------------------------------------------------------------------------
//L�schen des letzten gesendeten Befehls
void XpressNetClass::XNetclear() 
{
	XNetMsg[XNetlength] = 0x00;
	XNetMsg[XNetmsg] = 0x00;
	XNetMsg[XNetcom] = 0x00;
	XNetMsg[XNetdata1] = 0x00;
	XNetMsg[XNetdata2] = 0x00;
	XNetMsg[XNetdata3] = 0x00;
	XNetMsg[XNetdata4] = 0x00;
	XNetMsg[XNetdata5] = 0x00;
}

//--------------------------------------------------------------------------------------------
//Interrupt routine for reading via Serial
#if defined(__AVR__)
#if defined(SERIAL_PORT)
ISR(USART_RX_vect)  {
	XpressNetClass::handle_interrupt();	 //weiterreichen an die Funktion
}

#elif defined(SERIAL_PORT_0)
ISR(USART_RX_vect) {
	XpressNetClass::handle_interrupt();	 //weiterreichen an die Funktion
}

#elif defined(SERIAL_PORT_1)
ISR(USART1_RX_vect) {
	XpressNetClass::handle_interrupt();	 //weiterreichen an die Funktion
}
#endif
#elif defined(ARDUINO_ESP8266_ESP01)
// void RS485Data() {
// 	XpressNetClass::handle_interrupt();
// }
#endif

// Interrupt handling
/* static */
inline void XpressNetClass::handle_interrupt()
{
  if (active_object)
  {
    active_object->XNetget();	//Daten Einlesen und Speichern
  }
}

//--------------------------------------------------------------------------------------------
//Serial einlesen:
void XpressNetClass::XNetget() 
{
	unsigned int rxdata = USART_Receive();
	
	if ((int)rxdata != -1) {		//Daten wurden korrekt empfangen?
		// Serial.println(rxdata, BIN);
		previousMillis = 0;		//Reset Time Count
		// This IS a Call Byte
		if (rxdata >= 0x100) {		//Neue Nachricht beginnen
			ReadData = false;		//keine Speichern der Serial Daten
			if (rxdata == myRequestAck) {
				unsigned char requestAckAck[] = {0x20, 0x20};
				XNetsend(requestAckAck, 2);
				//Transfer Error
				if (notifyCVInfo)
					notifyCVInfo(0xE1);
				return;		//Daten wurden verarbeitet
			}
			else if (rxdata == myCallByteInquiry) {
				unsigned char commandStatusSequence[] = {0x21, 0x24, 0x05};
				if (XNetRun == false || Railpower == 0xFF) {
					XNetsend(commandStatusSequence, 3);
				}
				else XNetsend();
				return;		//Daten wurden verarbeitet
			}
			else if (rxdata == GENERAL_BROADCAST || rxdata == myDirectedOps) {	//Datenempfang aktivieren
				XNetclear();	//alte Nachricht l�schen
				ReadData = true;
			}
		}
		//add by Norberto Redondo Melchor:
		else if (rxdata == 0x52) {  // Let's spy on the bus: someone has requested an accessory change
			XNetMsg[XNetmsg] = 0x01;  // Any non-zero value would do
			XNetMsg[XNetlength] = 1;
			ReadData = true;          // Let's record this someone's request
		}
		if (ReadData == true) {   //Data is for our own address
			// Serial.println(rxdata, BIN);
			XNetMsg[XNetlength]++;      //Let's make room for it...
			XNetMsg[XNetMsg[XNetlength]] = rxdata;  //...and store it
		}
	}
}

//--------------------------------------------------------------------------------------------
void XpressNetClass::XNetclearSendBuf()		//Buffer leeren
{
	for (byte i = 0; i < XSendMax; i++) {
		XNetSend[i].length = 0x00;			//L�nge zur�cksetzten
		for (byte j = 0; j < XSendMaxData; j++) {
			XNetSend[i].data[j] = 0x00;		//Daten l�schen
		}
	}
}

//--------------------------------------------------------------------------------------------
boolean XpressNetClass::XNetSendadd(unsigned char *dataString, byte byteCount) 
{
	for (byte i = 0; i < XSendMax; i++) {
		if (XNetSend[i].length == 0) {	//Daten hier Eintragen:
			XNetSend[i].length = byteCount;	 //Datenlaenge
			for (byte b = 0; b < byteCount; b++) {
				XNetSend[i].data[b] = *dataString;
				dataString++;
			}
			return true;	//leeren Platz gefunden -> ENDE
		}
	}
	return false;	//Kein Platz im Sendbuffer frei!
}

//--------------------------------------------------------------------------------------------
//Byte via Serial senden
void XpressNetClass::XNetsend(void)
{	
	if (XNetSend[0].length != 0) { // && XNetSend[0].length < XSendMaxData) {
		if (XNetSend[0].data[0] != 0)
			XNetsend(XNetSend[0].data,XNetSend[0].length);
		for (int i = 0; i < (XSendMax-1); i++) {
			XNetSend[i].length = XNetSend[i+1].length;
			for (int j = 0; j < XSendMaxData; j++) {
				XNetSend[i].data[j] = XNetSend[i+1].data[j];		//Daten kopieren
			}
		}
		//letzten Leeren
		XNetSend[XSendMax-1].length = 0x00;
		for (int j = 0; j < XSendMaxData; j++) {
			XNetSend[XSendMax-1].data[j] = 0x00;		//Daten l�schen
		}
	}
	else XNetSend[0].length = 0;
}

//--------------------------------------------------------------------------------------------
// send along a bunch of bytes to the Command Station
void XpressNetClass::XNetsend(unsigned char *dataString, byte byteCount) {
	 unsigned int i;
#if defined(__AVR__)
	 if(MAX485_CONTROL >= 0) {
		 digitalWrite (MAX485_CONTROL, MAX485_REVERSE ? LOW : HIGH);
	 }
#endif
//   delayMicroseconds(3);
   for (i=0; i< byteCount; i++) {
     USART_Transmit (*dataString);
     dataString ++;
	}
#if defined(__AVR__)
	 WAIT_FOR_XMIT_COMPLETE;
	 if(MAX485_CONTROL >= 0) {
		 digitalWrite (MAX485_CONTROL, MAX485_REVERSE ? HIGH : LOW);
	 }
#endif
   
