kind3r/esp8266-xpressnet-lib/esp8266-XpressNet.cpp
} 


/*
***************************************** SLOTSERVER ****************************************
	uint8_t low;		// A7, A6, A5, A4, A3, A2, A1, A0
	uint8_t high;		//X, X, A13, A12, A11, A10, A9, A8
	uint8_t speed;		//Speed 0..127 (0x00 - 0x7F)
	uint8_t f0;		//0, 0, Dir, F0, F4, F3, F2, F1
	uint8_t f1;
	uint8_t func3;
	uint8_t func4;
	uint8_t state;	//Zahl der Zugriffe
*/

//--------------------------------------------------------------------------------------------
void XpressNetClass::UpdateBusySlot(void)	//Fragt Zentrale nach aktuellen Zust�nden
{
/*
	if (ReqLocoAdr == 0) {
		if (xLokStsIsEmpty(SlotLast) == false && xLokSts[SlotLast].state > 0 && xLokStsBusy(SlotLast) == true) { 
			byte Adr_High = xLokSts[SlotLast].high & 0x3F;
			byte Adr_Low = xLokSts[SlotLast].low; 
			ReqLocoAdr = word(Adr_High, Adr_Low); //Speichern der gefragen Lok Adresse
			unsigned char getLoco[] = {0xE3, 0x00, Adr_High, Adr_Low, 0x00};
			getXOR(getLoco, 5);
			XNetSendadd (getLoco, 5);
//			if (bitRead(xLokSts[SlotLast].mode, 3) == 1)	//Slot BUSY?
				getLocoFunc (Adr_High, Adr_Low);	//F13 bis F28 abfragen
		}
		int Slot = SlotLast;
		SlotLast = getNextSlot(SlotLast);	//n�chste Lok holen
		while (SlotLast != Slot) {
			if (xLokStsBusy(SlotLast) == true) {
				Slot = SlotLast;
				break;
			}
			SlotLast = getNextSlot(SlotLast);	//n�chste Lok holen
		}
		
	}
	else
*/	
	if (ReqLocoAdr != 0) {
		ReqLocoAgain++;
		if (ReqLocoAgain > 9) {
			unsigned char getLoco[] = {0xE3, 0x00, highByte(ReqLocoAdr), lowByte(ReqLocoAdr), 0x00};
			getXOR(getLoco, 5);
			XNetSendadd (getLoco, 5);
			ReqLocoAgain = 0;
		}
	}
/*
	//Nichtnutzung von Slots erfassen:
	for (int i = 0; i < SlotMax; i++) {
		if (xLokSts[i].state > 0)
			xLokSts[i].state--;
		if (xLokSts[i].state > 0)
			xLokSts[i].state--;
	}
*/
}

//--------------------------------------------------------------------------------------------
void XpressNetClass::xLokStsclear (void)	//l�scht alle Slots
{
	for (int i = 0; i < SlotMax; i++) {
		xLokSts[i].low = 0xFF;
		xLokSts[i].high = 0xFF;
		xLokSts[i].mode = 0xFF;
		xLokSts[i].speed = 0xFF;
		xLokSts[i].f0 = 0xFF;
		xLokSts[i].f1 = 0xFF;
		xLokSts[i].f2 = 0xFF;
		xLokSts[i].f3 = 0xFF;
		xLokSts[i].state = 0x00;
	}
}

//--------------------------------------------------------------------------------------------
bool XpressNetClass::xLokStsadd (byte MSB, byte LSB, byte Mode, byte Speed, byte FktSts)	//Eintragen �nderung / neuer Slot XLok
{
	bool change = false;
	byte Slot = xLokStsgetSlot(MSB, LSB);
	if (xLokSts[Slot].mode != Mode) {	//Busy & Fahrstufe (keine 14 Fahrstufen!)
		xLokSts[Slot].mode = Mode;
		change = true;
	}
	if (xLokSts[Slot].speed != Speed) {
		xLokSts[Slot].speed = Speed;
		change = true;
	}
	//FktSts = X, X, Dir, F0, F4, F3, F2, F1
	if (xLokSts[Slot].f0 != FktSts) {
		xLokSts[Slot].f0 = FktSts;
		change = true;
	}
	if (change == true && xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;
	return change;
}

//--------------------------------------------------------------------------------------------
bool XpressNetClass::xLokStsFunc0 (byte MSB, byte LSB, byte Func)	//Eintragen �nderung / neuer Slot XFunc
{
	bool change = false;
	byte Slot = xLokStsgetSlot(MSB, LSB);
	if ((xLokSts[Slot].f0 & B00011111) != Func) {
		xLokSts[Slot].f0 = Func | (xLokSts[Slot].f0 & B00100000);	//Dir anh�ngen!
		change = true;
	}
	if (change == true && xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;
	return change;
}

//--------------------------------------------------------------------------------------------
bool XpressNetClass::xLokStsFunc1 (byte MSB, byte LSB, byte Func1)	//Eintragen �nderung / neuer Slot XFunc1
{
	bool change = false;
	byte Slot = xLokStsgetSlot(MSB, LSB);
	if (xLokSts[Slot].f1 != Func1) {
		xLokSts[Slot].f1 = Func1;
		change = true;
	}
	if (change == true && xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;
	return change;
}

//--------------------------------------------------------------------------------------------
bool XpressNetClass::xLokStsFunc23 (byte MSB, byte LSB, byte Func2, byte Func3)	//Eintragen �nderung / neuer Slot
{
	bool change = false;
	byte Slot = xLokStsgetSlot(MSB, LSB);
	if (xLokSts[Slot].f2 != Func2) {
		xLokSts[Slot].f2 = Func2;
		change = true;
	}
	if (xLokSts[Slot].f3 != Func3) {
		xLokSts[Slot].f3 = Func3;
		change = true;
	}
	if (change == true && xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;
	return change;
}

bool XpressNetClass::xLokStsBusy (byte Slot) {
	bool Busy = false;
	if (bitRead(xLokSts[Slot].mode, 3) == 1)
		Busy = true;
	return Busy;
}

void XpressNetClass::XLokStsSetBusy (byte MSB, byte LSB) {
	byte Slot = xLokStsgetSlot(MSB, LSB);
	bitWrite(xLokSts[Slot].mode, 3, 1);
	if (xLokSts[Slot].state < 0xFF)
		xLokSts[Slot].state++;
}

//--------------------------------------------------------------------------------------------
byte XpressNetClass::xLokStsgetSlot (byte MSB, byte LSB)		//gibt Slot f�r Adresse zur�ck / erzeugt neuen Slot (0..126)
{
	byte Slot = 0x00;	//kein Slot gefunden!
	for (int i = 0; i < SlotMax; i++) {
		if ((xLokSts[i].low == LSB && xLokSts[i].high == MSB) || xLokStsIsEmpty(i)) {
			Slot = i;			//Slot merken
			if (xLokStsIsEmpty(Slot)) 	//neuer freier Slot - Lok eintragen
				xLokStsSetNew(Slot, MSB, LSB);	//Eintragen
			return Slot;
		}
	}
	//kein Slot mehr vorhanden!
	byte zugriff = 0xFF;
	for (int i = 0; i < SlotMax; i++) {
		if (xLokSts[i].state < zugriff) {
			Slot = i;
			zugriff = xLokSts[i].state;
		}
	}
	xLokStsSetNew(Slot, MSB, LSB);	//Eintragen
	return Slot;
}

//--------------------------------------------------------------------------------------------
int XpressNetClass::xLokStsgetAdr (byte Slot)			//gibt Lokadresse des Slot zur�ck, wenn 0x0000 dann keine Lok vorhanden
{
	if (!xLokStsIsEmpty(Slot))
		return word(xLokSts[Slot].high, xLokSts[Slot].low);	//Addresse zur�ckgeben
	return 0x0000;
}

//--------------------------------------------------------------------------------------------
bool XpressNetClass::xLokStsIsEmpty (byte Slot)	//pr�ft ob Datenpacket/Slot leer ist?
{
	if (xLokSts[Slot].low == 0xFF && xLokSts[Slot].high == 0xFF && xLokSts[Slot].speed == 0xFF && xLokSts[Slot].f0 == 0xFF && 
		xLokSts[Slot].f1 == 0xFF && xLokSts[Slot].f2 == 0xFF && xLokSts[Slot].f3 == 0xFF && xLokSts[Slot].state == 0x00)
		return true;
	return false;
}

//--------------------------------------------------------------------------------------------
void XpressNetClass::xLokStsSetNew (byte Slot, byte MSB, byte LSB)	//Neue Lok eintragen mit Adresse
{
	xLokSts[Slot].low = LSB;
	xLokSts[Slot].high = MSB;
	xLokSts[Slot].mode = B1011;	//Busy und 128 Fahrstufen
	xLokSts[Slot].speed = 0x00;
	xLokSts[Slot].f0 = 0x00;
	xLokSts[Slot].f1 = 0x00;
	xLokSts[Slot].f2 = 0x00;
	xLokSts[Slot].f3 = 0x00;
	xLokSts[Slot].state = 0x00;
}

//--------------------------------------------------------------------------------------------
byte XpressNetClass::getNextSlot (byte Slot)	//gibt n�chsten genutzten Slot
{
	byte nextS = Slot;
	for (int i = 0; i < SlotMax; i++) {
		nextS++;	//n�chste Lok
		if (nextS >= SlotMax)
			nextS = 0;	//Beginne von vorne
		if (xLokStsIsEmpty(nextS) == false)
			return nextS;
	}
	return nextS;
}

//--------------------------------------------------------------------------------------------
void XpressNetClass::setFree(byte MSB, byte LSB)		//Lok aus Slot nehmen
{
	byte Slot = xLokStsgetSlot(MSB, LSB);
	xLokSts[Slot].low = 0xFF;
	xLokSts[Slot].high = 0xFF;
	xLokSts[Slot].mode = 0xFF;
	xLokSts[Slot].speed = 0xFF;
	xLokSts[Slot].f0 = 0xFF;
	xLokSts[Slot].f1 = 0xFF;
	xLokSts[Slot].f2 = 0xFF;
	xLokSts[Slot].f3 = 0xFF;
	xLokSts[Slot].state = 0x00;
}